/*
¤p¸sÅé
°İÃD´y­z
    Q¦P¾Ç¥¿¦b¾Ç²ßµ{¦¡¡A P ¦Ñ®v¥X¤F¥H¤UªºÃD¥ØÅı¥L½m²ß¡C
    ¤@¸s¤H¦b¤@ş®É¸g±`·|§Î¦¨¤@­Ó¤@­Óªº¤p
    ¸s Åé¡C°²³]¦³ N ­Ó¤H¡A½s¸¹¥Ñ 0 ¨ì N 1 ¡A¨C
    ­Ó¤Hm¼g¤U¥L³Ì¦nªB¤Íªº½s¸¹¡]³Ì¦nªB¤Í¦³¥i¯à¬O¥L¦Û¤vªº½s¸¹¡A¦pªG¥L¦Û¤v¨S¦³¨ä
    ¥L¦n¤Í¡^¡A ¦b¥»ÃD¤¤¡A ¨C­Ó¤Hªº ¦n¤Í½s¸¹µ´¹ï¤£·|­«½Æ¡A¤]´N¬O»¡ 0 ¨ì N 1 ¨C­Ó¼Æ¦r
    m «ê¦n ¥X²{¤@¦¸ ¡C
    ³oºØ¦n¤ÍªºÃö«Y·|§Î¦¨¤@
    ¨Ç ¤p ¸s Åé¡C¨Ò¦p N=10 ¡A
    ¦n¤Í½s¸¹¦p¤U   0 1 2 3 4 5 6 7 8 9
    ¦n¤Í½s¸¹ 4 7 2 9 6 0 8 1 5 3 0
    ªº¦n¤Í¬O 4 4 ªº¦n¤Í¬O 6 6 ªº¦n¤Í¬O 8 8 ªº¦n¤Í¬O 5 5 ªº¦n¤Í¬O 0 ¡A©Ò¥H 0 ¡B 4 ¡B
    6 ¡B 8 ¡B©M 5 ´N§Î¦¨¤F¤@­Ó¤p¸sÅé¡C¥t¥~¡A 1 ªº¦n¤Í¬O 7 ¦Ó¥B 7 ªº¦n¤Í¬O 1 ¡A©Ò¥H 1 ©M
    7 §Î¦¨¥t¤@­Ó¤p ¸s Åé¡A¦P²z¡A 3 ©M 9 ¬O¤@­Ó¤p ¸s Åé¡A¦Ó 2 ªº¦n¤Í¬O¦Û¤v¡A¦]¦¹¥L ¦Û¤v
    ¬O¤@­Ó¤p ¸s Åé ¡CÁ`¦Ó¨¥¤§¡A ¦b³o ­Ó¨Ò¤l ¸Ì¦³ 4 ­Ó¤p ¸s Åé 0 4 6 8 5 ¡B { ¡B { ¡B
    { ¡C ¥»ÃDªº°İÃD¬O¡G¿é¤J¨C­Ó¤Hªº¦n¤Í½s¸¹¡A­pºâ¥XÁ`¦@¦³´X­Ó¤p¸sÅé¡C
    Q
    ¦P¾Ç·Q¤F·Q«o¤£ª¾¦p¦ó¤U¤â¡A©MÄ§¥i¿Ëªº P ¦Ñ®v©ó¬Oµ¹¤F¥L¥H¤Uªº´£¥Ü¡G¦pªG§A±q
    ¥ô¦ó¤@¤H x ¶}©l¡A°lÂÜ¥Lªº¦n¤Í¡A¦n¤Í ªº¦n¤Í¡A ¡A¡K¡K..¡A³o¼Ë¤@ª½¤U¥h¡A¤@©w·|§Î¦¨¤@
    ­Ó°é¦^¨ì x ³o´N¬O¤@­Ó¤p¸sÅé¡C¦pªG§Ú­Ì°lÂÜªº¹Lµ{¤¤§â°lÂÜ¹Lªº¥[¥H¼Ğ°O¡A«Ü®e
    ©öª¾¹D­ş¨Ç¤H¤w¸g°lÂÜ¹L¡A¦]¦¹¡A·í¤@­Ó¤p¸sÅé§ä¨ì¤§«á¡A§Ú­Ì¦A±q¥ô¦ó¤@­ÓÁÙ¥¼°l
    ÂÜ¹Lªº¶}©lÄ~Äò§ä¤U¤@­Ó¤p¸sÅé¡Aª½¨ì©Ò¦³ªº¤Hm°lÂÜ§¹²¦¡C
    Q
    ¦P¾ÇÅ¥§¹¤§«á«Ü¶¶§Qªº§¹¦¨¤F§@·~¡C
    ¦b¥»ÃD¤¤¡A§Aªº¥ô°È»P
    Q ¦P¾Ç¤@¼Ë¡Gµ¹©w¤@¸s¤Hªº¦n¤Í¡A½Ğ­pºâ¥X¤p¸sÅé­Ó¼Æ¡C

¿é¤J®æ¦¡
    ²Ä¤@¦æ ¬O¤@­Ó ¥¿¾ã¼Æ N ¡A»¡©ú¹ÎÅé¤¤¤H¼Æ¡C
    ²Ä¤G¦æ ¨Ì§Ç¬O 0 ªº¦n¤Í½s¸¹ ¡B 1 ªº¦n¤Í½s¸¹ ¡B ¡B N 1 ªº¦n¤Í½s¸¹¡C¦@ ¦³ N ­Ó¼Æ¦r¡A
    ¥]§t 0 ¨ì N 1 ªº¨C­Ó¼Æ¦r«ê¦n¥X ²{¤@¦¸ ¡A¼Æ¦r¶¡·|¦³¤@­ÓªÅ¥Õ¹j¶}¡C
¿é¥X®æ¦¡
    ½Ğ¿é¥X¤p
    ¸s Åéªº­Ó¼Æ¡C ¤£­n¦³¥ô¦ó¦h¾lªº¦r©ÎªÅ¥Õ¡A¨Ã ¥H´«¦æ¦r¤¸µ²§À ¡C

*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int count = 0;
    int number, j, k;

    scanf("%d", &number);
    int num_x[1000] = {0};
    int num_y[1000] = {0};

    for (int i = 0; i < number; i++)
        scanf("%d", &num_x[i]);

    for (k = 0; k < number; k++)
    {
        if (num_y[k] == 0)
        {
            count++;
            num_y[k] = 1;
            j = num_x[k];
            while (j != k)
            {
                num_y[j] = 1;
                j = num_x[j];
            }
        }
    }
    printf("%-2d", count);

    return 0;
}